Arsip/app/Controllers/Dashboard.php

    public function logout() {
        $this->logModel->where('id_log', session()->get('id_log'))->delete();
---
UPDATE `tbl_log` SET `deleted_at` = '2022-03-22 21:02:55', `updated_at` = '2022-03-22 21:02:55'
WHERE `id_log` = 'LOG-6239d6e472330'