Arsip/app/Controllers/KategoriArsip.php

    public function __construct()
    {
        $this->validation = \Config\Services::validation();
        $this->validation->setRules([
                'kategori' => [
                    'label'  => 'Kategori',
                    'rules'  => 'required',
                    'errors' => [
                        'required' => '{field} wajib diisi',
                    ],
                ],
            ]
        );

        $this->userModel = new \App\Models\UserModel();
        $this->kategoriModel = new \App\Models\KategoriModel();
        $this->dataUser = $this->userModel->where('id_user', session()->get('idUser'))->first();
---
SELECT *
FROM `tbl_user`
WHERE `id_user` = 'USER-3b25235d'
 LIMIT 1

    public function index()
    {
        $perPage = 20;

        $checkKeyword = $this->request->getGet('keyword') ?
            $this->kategoriModel->like('kategori', $this->request->getGet('keyword')) :
            $this->kategoriModel;

        $data = [
          'title' => 'Dashboard Kategori Arsip',
            'dataUser' => $this->dataUser,
            'dataKategori' => $checkKeyword->paginate($perPage, 'tbl_kategori_arsip'),
---
SELECT *
FROM `tbl_kategori_arsip`
 LIMIT 20
SELECT COUNT(*) AS `numrows`
FROM `tbl_kategori_arsip`