Arsip/app/Controllers/Login.php

SELECT *
FROM `tbl_user`
WHERE `username` = 'DNSBAPPEDA21'
 LIMIT 1
---
    public function dataLogin()
    {
        if ($this->validation->withRequest($this->request)->run()) {
            $username = $this->request->getPost('username');
            $password = $this->request->getPost('password');

            $checkUsername = $this->userModel->where('username', $username)->first();